Revit 2026 API

# MEPCalculationServerInfo(IExternalServer) Constructor

---

Create a new MEPCalculationServerInfo by an external server.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPCalculationServerInfo(
	IExternalServer server
)
```
```vb
Public Sub New (
	server As IExternalServer
)
```
```cpp
public:
MEPCalculationServerInfo(
	IExternalServer^ server
)
```
```fsharp
new :
        server : IExternalServer -> MEPCalculationServerInfo
```

#### Parameters

server IExternalServer
     The external server.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

MEPCalculationServerInfo Class

MEPCalculationServerInfo Overload

Autodesk.Revit.DB Namespace